lhd-Sakura/A_Project/STM32CubeMX/资料/代码/VSLAM_Car/STM32Cube/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2019 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define Speed1_L_Pin GPIO_PIN_0
#define Speed1_L_GPIO_Port GPIOA
#define Speed2_R_Pin GPIO_PIN_3
#define Speed2_R_GPIO_Port GPIOA
#define Speed2_L_Pin GPIO_PIN_6
#define Speed2_L_GPIO_Port GPIOA
#define IN1_L_Pin GPIO_PIN_9
#define IN1_L_GPIO_Port GPIOE
#define IN2_L_Pin GPIO_PIN_11
#define IN2_L_GPIO_Port GPIOE
#define IN3_L_Pin GPIO_PIN_13
#define IN3_L_GPIO_Port GPIOE
#define IN4_L_Pin GPIO_PIN_14
#define IN4_L_GPIO_Port GPIOE
#define Speed1_R_Pin GPIO_PIN_12
#define Speed1_R_GPIO_Port GPIOD
#define IN1_R_Pin GPIO_PIN_6
#define IN1_R_GPIO_Port GPIOC
#define IN2_R_Pin GPIO_PIN_7
#define IN2_R_GPIO_Port GPIOC
#define IN3_R_Pin GPIO_PIN_8
#define IN3_R_GPIO_Port GPIOC
#define IN4_R_Pin GPIO_PIN_9
#define IN4_R_GPIO_Port GPIOC
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
